# this is  a PANDAS Notebook

## PANDAS stands for Panel Data Analysis

#### How to install Packages

In [6]:
# pip install pandas
# Pip install numpy

### Importing Libraries

In [7]:
import numpy as np
import pandas as pd

In [9]:
# Object Creation
# Series in Pandas

s= pd.Series([1,2,3,4,5,np.nan,6])
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    6.0
dtype: float64

In [24]:
dates = pd.date_range("20220101",periods=5)
dates

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05'],
              dtype='datetime64[ns]', freq='D')

In [41]:
date_frame = pd.DataFrame(np.random.rand(5,4), index=dates , columns=list("ABCD"))
date_frame

                   A         B         C         D
2022-01-01  0.391096  0.926503  0.142757  0.325610
2022-01-02  0.450693  0.223945  0.543369  0.850109
2022-01-03  0.947077  0.239365  0.855548  0.184413
2022-01-04  0.841881  0.576437  0.612228  0.222879
2022-01-05  0.456326  0.815668  0.285845  0.802479

In [35]:
data_frame2=pd.DataFrame(
    {
        'A': 1.0,
        'B': pd.Timestamp("20130102"),
        'C': pd.Series(1,index=list(range(4)),dtype="float32"),
        'D': np.array([3]*4,dtype="int32"),
        'E': pd.Categorical(['test','train','test','train']),
        'F': "foo"
    }
)
data_frame2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [36]:
data_frame2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [37]:
# Converting a PANDAS Data Frame to Numpy array object

data_frame2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [40]:
# Maniupulation of Dataframes with different functions

date_frame.describe()

              A         B         C         D
count  5.000000  5.000000  5.000000  5.000000
mean   0.046872  0.424471  0.369137 -0.287224
std    0.664113  1.376150  0.730635  1.354117
min   -1.032036 -1.503327 -0.142580 -1.722246
25%   -0.006634 -0.399843 -0.071111 -1.606815
50%    0.196394  0.687345  0.064804 -0.141470
75%    0.323977  1.591625  0.365672  0.783105
max    0.752658  1.746556  1.628902  1.251306

In [46]:
date_frame.sort_index(axis=0,ascending=False)

                   A         B         C         D
2022-01-05  0.456326  0.815668  0.285845  0.802479
2022-01-04  0.841881  0.576437  0.612228  0.222879
2022-01-03  0.947077  0.239365  0.855548  0.184413
2022-01-02  0.450693  0.223945  0.543369  0.850109
2022-01-01  0.391096  0.926503  0.142757  0.325610

In [47]:
data_frame2.head(3)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [49]:
date_frame.tail(2)

                   A         B         C         D
2022-01-04  0.841881  0.576437  0.612228  0.222879
2022-01-05  0.456326  0.815668  0.285845  0.802479

In [52]:
data_frame2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [53]:
#  transpose row into columns
data_frame2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [54]:
date_frame["A"]

2022-01-01    0.391096
2022-01-02    0.450693
2022-01-03    0.947077
2022-01-04    0.841881
2022-01-05    0.456326
Freq: D, Name: A, dtype: float64